#include <stdio.h>
int  main()
{
short s;
int i;
long l;
unsigned short us;
unsigned int ui;
unsigned long ul;
scanf("%hd", &s);
printf("%d", s);
/* 执行以上语句时，
输入 显示
-32769
-32768
32767
32768
可见，short 数据在 64 位计算机上的表示范围是：-32768~32767
*/
scanf("%d", &i);
printf("%d", i);
/* 执行以上语句时，
输入 显示
-2147483649
-2147483648
2147483647
2147483648
可见，int 数据在 64 位计算机上的表示范围是：-2147483648~2147483647
*/
scanf("%ld", &l);
printf("%ld", l);
/* 执行以上语句时，
输入 显示
-2147483649
-2147483648
2147483647
2147483648
可见，long 数据在 64 位计算机上的表示范围是：-2147483649~2147483647
*/
scanf("%hu", &us);
printf("%u", us);
/* 执行以上语句时，
输入 显示
-1
0
65535
65536
可见，unsigned short 数据在 64 位计算机上的表示范围是：0~65535*/
scanf("%u", &ui);
printf("%u", ui);
/* 执行以上语句时，
输入 显示
-1
0
4294967295
4294967296
可见，unsigned int 数据在 64 位计算机上的表示范围是：0~4294967295*/
scanf("%lu", &ul);
printf("%lu", ul);
/* 执行以上语句时，
输入 显示
-1
0
4294967295
4294967296
可见，unsigned long 数据在 64 位计算机上的表示范围是：0~*/
system("pause");
 
}

